app/models/user.rb

  def self.find_by_credentials(email, password)
    user = User.find_by(email: email)
---
SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "asd@aol.com"], ["LIMIT", 1]]

  def reset_session_token!
    self.session_token = User.generate_session_token
    self.save!
---
UPDATE "users" SET "session_token" = $1, "updated_at" = $2 WHERE "users"."id" = $3  [["session_token", "-wOq4M2AbYwdr5isdMytzw"], ["updated_at", "2019-07-30 19:20:50.374100"], ["id", 1]]